COLOR_DICT = {
        0: ['232', '232', '232'],    # 其他
        1: ['255', '218', '185'],   # 台基
        2: ['255', '0', '0'],      # 台阶
        3: ['0', '139', '139'],  # 地面
        4: ['173', '255', '47'],   # 墙体
        5: ['255', '20', '147'],   # 天花板
        6: ['255', '185', '15'],   # 屋顶
        7: ['0', '245', '255'],   # 护栏
        8: ['238', '238', '0'],   # 枋
        9: ['139', '0', '0'],   # 柱子
        10: ['58', '95', '205'],   # 门窗
        11: ['153', '50', '204']   # 雀替
    }

DATA_PATH = r'./data'
DATA_FILE = 'rooms.txt'
ZOOM_FACTOR = 1

TEST_AREA = 'test'
LEARNING_RATE = 0.001
DECAY_STEPS = 1733*25
DECAY_RATE = 0.50
LOG = 'log'
EPOCH = 150
BATCH_SIZE = 4
TEST_FREQUENCY = 1
SAVE_FREQUENCY = 10
NUM_CLASSES = 12
